---
type: ConicalSurface
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# ConicalSurface

`Autodesk.Revit.DB.ConicalSurface` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static ConicalSurface Create ( Frame frameOfReference , double halfAngle )` |
| Method | GetFrameOfReference | 2017 | `public Frame GetFrameOfReference ()` |
| Method | IsValidConeAngle | 2017 | `public static bool IsValidConeAngle ( double halfAngle )` |
| Property | Axis | 2017 | `public XYZ Axis { get ; }` |
| Property | HalfAngle | 2017 | `public double HalfAngle { get ; }` |
| Property | Origin | 2017 | `public XYZ Origin { get ; }` |
| Property | XDir | 2017 | `public XYZ XDir { get ; }` |
| Property | YDir | 2017 | `public XYZ YDir { get ; }` |